grpc-vs-rest-microservice-fan-out-benchmark/grpc.txt
Run #1
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |     3,149 |    33,751
> min response time (ms)                                                             |        41 |        41 |    15,000
> max response time (ms)                                                             |    60,005 |    23,681 |    60,005
> mean response time (ms)                                                            |    17,893 |     4,345 |    19,157
> response time std deviation (ms)                                                   |    13,206 |     4,922 |    13,026
> response time 50th percentile (ms)                                                 |    15,002 |     1,899 |    15,002
> response time 75th percentile (ms)                                                 |    15,002 |     6,841 |    15,002
> response time 95th percentile (ms)                                                 |    60,000 |    15,028 |    60,000
> response time 99th percentile (ms)                                                 |    60,001 |    20,686 |    60,002
> mean throughput (rps)                                                              |    150.61 |     12.85 |    137.76
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                            861  (2.33%)
> OK: 800 ms <= t < 1200 ms                                                                                 237  (0.64%)
> OK: t >= 1200 ms                                                                                        2,051  (5.56%)
> KO                                                                                                     33,751 (91.47%)
---- Errors ------------------------------------------------------------------------------------------------------------
> i.g.h.c.i.PrematureCloseException: Premature close                                                     30,635 (90.77%)
> Request timeout to localhost/127.0.0.1:8080 after 60000 ms                                              3,116  (9.23%)
========================================================================================================================

Run #2
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |     5,640 |    31,260
> min response time (ms)                                                             |         6 |         6 |    15,000
> max response time (ms)                                                             |    60,058 |    23,063 |    60,058
> mean response time (ms)                                                            |    17,131 |     3,547 |    19,582
> response time std deviation (ms)                                                   |    13,881 |     4,165 |    13,602
> response time 50th percentile (ms)                                                 |    15,002 |     1,196 |    15,002
> response time 75th percentile (ms)                                                 |    15,003 |     6,097 |    15,003
> response time 95th percentile (ms)                                                 |    60,000 |    12,478 |    60,000
> response time 99th percentile (ms)                                                 |    60,001 |    16,027 |    60,002
> mean throughput (rps)                                                              |    150.61 |     23.02 |    127.59
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                          2,483  (6.73%)
> OK: 800 ms <= t < 1200 ms                                                                                 347  (0.94%)
> OK: t >= 1200 ms                                                                                        2,810  (7.62%)
> KO                                                                                                     31,260 (84.72%)
---- Errors ------------------------------------------------------------------------------------------------------------
> i.g.h.c.i.PrematureCloseException: Premature close                                                     28,080 (89.83%)
> Request timeout to localhost/127.0.0.1:8080 after 60000 ms                                              3,180 (10.17%)
========================================================================================================================

Run #3
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |    36,900 |         -
> min response time (ms)                                                             |         3 |         3 |         -
> max response time (ms)                                                             |    10,353 |    10,353 |         -
> mean response time (ms)                                                            |        57 |        57 |         -
> response time std deviation (ms)                                                   |       423 |       423 |         -
> response time 50th percentile (ms)                                                 |         4 |         4 |         -
> response time 75th percentile (ms)                                                 |        12 |        12 |         -
> response time 95th percentile (ms)                                                 |       158 |       158 |         -
> response time 99th percentile (ms)                                                 |       493 |       493 |         -
> mean throughput (rps)                                                              |    160.43 |    160.43 |         -
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                         36,599 (99.18%)
> OK: 800 ms <= t < 1200 ms                                                                                  27  (0.07%)
> OK: t >= 1200 ms                                                                                          274  (0.74%)
> KO                                                                                                          0     (0%)
========================================================================================================================

Run #4
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |    36,900 |         -
> min response time (ms)                                                             |         3 |         3 |         -
> max response time (ms)                                                             |    12,730 |    12,730 |         -
> mean response time (ms)                                                            |        79 |        79 |         -
> response time std deviation (ms)                                                   |       597 |       597 |         -
> response time 50th percentile (ms)                                                 |         4 |         4 |         -
> response time 75th percentile (ms)                                                 |         8 |         8 |         -
> response time 95th percentile (ms)                                                 |       182 |       182 |         -
> response time 99th percentile (ms)                                                 |       805 |       805 |         -
> mean throughput (rps)                                                              |    160.43 |    160.43 |         -
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                         36,528 (98.99%)
> OK: 800 ms <= t < 1200 ms                                                                                  28  (0.08%)
> OK: t >= 1200 ms                                                                                          344  (0.93%)
> KO                                                                                                          0     (0%)
========================================================================================================================

Run #5
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |    36,900 |         -
> min response time (ms)                                                             |         3 |         3 |         -
> max response time (ms)                                                             |     9,749 |     9,749 |         -
> mean response time (ms)                                                            |       126 |       126 |         -
> response time std deviation (ms)                                                   |       521 |       521 |         -
> response time 50th percentile (ms)                                                 |         4 |         4 |         -
> response time 75th percentile (ms)                                                 |        27 |        27 |         -
> response time 95th percentile (ms)                                                 |       875 |       875 |         -
> response time 99th percentile (ms)                                                 |     2,068 |     2,068 |         -
> mean throughput (rps)                                                              |    160.43 |    160.43 |         -
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                         34,967 (94.76%)
> OK: 800 ms <= t < 1200 ms                                                                                 538  (1.46%)
> OK: t >= 1200 ms                                                                                        1,395  (3.78%)
> KO                                                                                                          0     (0%)
========================================================================================================================

Run #6
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |    36,900 |         -
> min response time (ms)                                                             |         3 |         3 |         -
> max response time (ms)                                                             |     9,859 |     9,859 |         -
> mean response time (ms)                                                            |        64 |        64 |         -
> response time std deviation (ms)                                                   |       408 |       408 |         -
> response time 50th percentile (ms)                                                 |         5 |         5 |         -
> response time 75th percentile (ms)                                                 |        31 |        31 |         -
> response time 95th percentile (ms)                                                 |       201 |       201 |         -
> response time 99th percentile (ms)                                                 |       599 |       599 |         -
> mean throughput (rps)                                                              |    160.43 |    160.43 |         -
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                         36,616 (99.23%)
> OK: 800 ms <= t < 1200 ms                                                                                  39  (0.11%)
> OK: t >= 1200 ms                                                                                          245  (0.66%)
> KO                                                                                                          0     (0%)
========================================================================================================================

Run #7
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |    36,900 |         -
> min response time (ms)                                                             |         3 |         3 |         -
> max response time (ms)                                                             |     9,031 |     9,031 |         -
> mean response time (ms)                                                            |        53 |        53 |         -
> response time std deviation (ms)                                                   |       366 |       366 |         -
> response time 50th percentile (ms)                                                 |         4 |         4 |         -
> response time 75th percentile (ms)                                                 |        15 |        15 |         -
> response time 95th percentile (ms)                                                 |       186 |       186 |         -
> response time 99th percentile (ms)                                                 |       470 |       470 |         -
> mean throughput (rps)                                                              |    160.43 |    160.43 |         -
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                         36,673 (99.38%)
> OK: 800 ms <= t < 1200 ms                                                                                  16  (0.04%)
> OK: t >= 1200 ms                                                                                          211  (0.57%)
> KO                                                                                                          0     (0%)
========================================================================================================================

Run #8
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |    36,900 |         -
> min response time (ms)                                                             |         3 |         3 |         -
> max response time (ms)                                                             |    10,320 |    10,320 |         -
> mean response time (ms)                                                            |        63 |        63 |         -
> response time std deviation (ms)                                                   |       441 |       441 |         -
> response time 50th percentile (ms)                                                 |         4 |         4 |         -
> response time 75th percentile (ms)                                                 |        14 |        14 |         -
> response time 95th percentile (ms)                                                 |       202 |       202 |         -
> response time 99th percentile (ms)                                                 |       568 |       568 |         -
> mean throughput (rps)                                                              |    160.43 |    160.43 |         -
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                         36,623 (99.25%)
> OK: 800 ms <= t < 1200 ms                                                                                  14  (0.04%)
> OK: t >= 1200 ms                                                                                          263  (0.71%)
> KO                                                                                                          0     (0%)
========================================================================================================================

Run #9
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |    36,900 |         -
> min response time (ms)                                                             |         3 |         3 |         -
> max response time (ms)                                                             |     8,937 |     8,937 |         -
> mean response time (ms)                                                            |        51 |        51 |         -
> response time std deviation (ms)                                                   |       350 |       350 |         -
> response time 50th percentile (ms)                                                 |         4 |         4 |         -
> response time 75th percentile (ms)                                                 |        11 |        11 |         -
> response time 95th percentile (ms)                                                 |       169 |       169 |         -
> response time 99th percentile (ms)                                                 |       512 |       512 |         -
> mean throughput (rps)                                                              |    160.43 |    160.43 |         -
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                         36,684 (99.41%)
> OK: 800 ms <= t < 1200 ms                                                                                  23  (0.06%)
> OK: t >= 1200 ms                                                                                          193  (0.52%)
> KO                                                                                                          0     (0%)
========================================================================================================================

Run #10
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |    36,900 |         -
> min response time (ms)                                                             |         3 |         3 |         -
> max response time (ms)                                                             |    11,755 |    11,755 |         -
> mean response time (ms)                                                            |       100 |       100 |         -
> response time std deviation (ms)                                                   |       558 |       558 |         -
> response time 50th percentile (ms)                                                 |         4 |         4 |         -
> response time 75th percentile (ms)                                                 |        24 |        24 |         -
> response time 95th percentile (ms)                                                 |       425 |       425 |         -
> response time 99th percentile (ms)                                                 |     1,469 |     1,469 |         -
> mean throughput (rps)                                                              |    160.43 |    160.43 |         -
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                         35,754 (96.89%)
> OK: 800 ms <= t < 1200 ms                                                                                 609  (1.65%)
> OK: t >= 1200 ms                                                                                          537  (1.46%)
> KO                                                                                                          0     (0%)
========================================================================================================================